def dictionary():
    dict = {
        "=41": "A",
        "=5A": "Z",
        "=61": "a",
        "=7A": "z",
        "=C0": "À",
        "=C1": "Á",
        "=C2": "Â",
        "=C3": "Ã",
        "=C4": "Ä",
        "=C5": "Å",
        "=C7": "Ç",
        "=C8": "È",
        "=C9": "É",
        "=CA": "Ê",
        "=CB": "Ë",
        "=CC": "Ì",
        "=CD": "Í",
        "=CE": "Î",
        "=CF": "Ï",
        "=D1": "Ñ",
        "=D2": "Ò",
        "=D3": "Ó",
        "=D4": "Ô",
        "=D5": "Õ",
        "=D6": "Ö",
        "=D9": "Ù",
        "=DA": "Ú",
        "=DB": "Û",
        "=DC": "Ü",
        "=DD": "Ý",
        "=E0": "à",
        "=E1": "á",
        "=E2": "â",
        "=E3": "ã",
        "=E4": "ä",
        "=E7": "ç",
        "=E8": "è",
        "=E9": "é",
        "=EA": "ê",
        "=EB": "ë",
        "=EC": "ì",
        "=ED": "í",
        "=EE": "î",
        "=EF": "ï",
        "=F1": "ñ",
        "=F2": "ò",
        "=F3": "ó",
        "=F4": "ô",
        "=F5": "õ",
        "=F6": "ö",
        "=F9": "ù",
        "=FA": "ú",
        "=FB": "û",
        "=FC": "ü",
        "=FD": "ý",
        "=FF": "ÿ"
    }

    return dict

def convertISO8859(name, dict):
    for key in dict.keys():
        name =name.replace(key, dict[key])
    
    return name

